## 📦 Terraform Plan Output

```hcl
module.lambda_trigger_cpu.data.external.archive_prepare[0]: Reading...
module.lambda_trigger_mem.data.external.archive_prepare[0]: Reading...
module.lambda_trigger_mem.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_trigger_cpu.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_trigger_cpu.local_file.archive_plan[0]: Refreshing state... [id=cde1c130f6d0a88e97cc256f2e084fd1e53220ad]
module.lambda_trigger_mem.local_file.archive_plan[0]: Refreshing state... [id=4becbcde4db0883e2a4374291dd997b3192e55bc]
module.lambda_trigger_mem.null_resource.archive[0]: Refreshing state... [id=8583920096647612317]
module.lambda_trigger_cpu.null_resource.archive[0]: Refreshing state... [id=5441092466436930499]
module.lambda_trigger_cpu.data.aws_iam_policy_document.assume_role[0]: Reading...
data.aws_caller_identity.current: Reading...
module.eventbridge_lambda_triggers.data.aws_caller_identity.current: Reading...
module.lambda_trigger_mem.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_trigger_mem.data.aws_caller_identity.current: Reading...
module.lambda_trigger_mem.data.aws_partition.current: Reading...
module.alb.data.aws_partition.current: Reading...
aws_ecr_repository.ecr: Refreshing state... [id=ecr-kapset]
aws_iam_role.ec2_role: Refreshing state... [id=ec2-ecr-access-role]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02f09b3c1a37627bf]
module.lambda_trigger_cpu.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lambda_trigger_mem.data.aws_partition.current: Read complete after 0s [id=aws]
module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_trigger_mem.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lambda_trigger_cpu.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/trigger_cpu_load]
module.eventbridge_lambda_triggers.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_trigger_cpu.data.aws_caller_identity.current: Reading...
module.eventbridge_lambda_triggers.data.aws_cloudwatch_event_bus.this[0]: Reading...
module.eventbridge_lambda_triggers.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3959961479]
module.eventbridge_lambda_triggers.data.aws_region.current: Reading...
module.eventbridge_lambda_triggers.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.lambda_trigger_mem.data.aws_region.current: Reading...
module.lambda_trigger_mem.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.eventbridge_lambda_triggers.data.aws_partition.current: Reading...
module.eventbridge_lambda_triggers.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_trigger_cpu.data.aws_region.current: Reading...
module.lambda_trigger_cpu.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.lambda_trigger_mem.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/trigger_mem_load]
module.lambda_trigger_mem.data.aws_caller_identity.current: Read complete after 0s [id=341795649416]
module.lambda_trigger_cpu.data.aws_partition.current: Reading...
module.lambda_trigger_cpu.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_trigger_cpu.aws_iam_role.lambda[0]: Refreshing state... [id=trigger_cpu_load]
module.eventbridge_lambda_triggers.data.aws_caller_identity.current: Read complete after 0s [id=341795649416]
module.lambda_trigger_mem.aws_iam_role.lambda[0]: Refreshing state... [id=trigger_mem_load]
data.aws_caller_identity.current: Read complete after 0s [id=341795649416]
module.eventbridge_lambda_triggers.aws_iam_role.eventbridge[0]: Refreshing state... [id=default]
module.lambda_trigger_cpu.data.aws_caller_identity.current: Read complete after 0s [id=341795649416]
aws_iam_role_policy_attachment.ecr_access: Refreshing state... [id=ec2-ecr-access-role-20250408145157111000000001]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-ecr-access-profile]
module.eventbridge_lambda_triggers.data.aws_cloudwatch_event_bus.this[0]: Read complete after 0s [id=default]
aws_iam_role_policy_attachment.ssm_core: Refreshing state... [id=ec2-ecr-access-role-20250408145157178300000002]
module.lambda_trigger_mem.data.aws_iam_policy_document.logs[0]: Reading...
module.eventbridge_lambda_triggers.aws_cloudwatch_event_rule.this["trigger_mem"]: Refreshing state... [id=trigger-mem-rule]
module.eventbridge_lambda_triggers.aws_cloudwatch_event_rule.this["trigger_cpu"]: Refreshing state... [id=trigger-cpu-rule]
module.lambda_trigger_cpu.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_trigger_mem.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3625547528]
module.lambda_trigger_cpu.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4092066449]
module.lambda_trigger_cpu.aws_iam_role_policy.logs[0]: Refreshing state... [id=trigger_cpu_load:trigger_cpu_load-logs]
aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=ecr-kapset]
module.lambda_trigger_mem.aws_iam_role_policy.logs[0]: Refreshing state... [id=trigger_mem_load:trigger_mem_load-logs]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0eaf35f8364b0f799]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07eec454a585f8733]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-05a61466f13e59852]
aws_security_group.app_sg: Refreshing state... [id=sg-04fb791de1fb3975b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04f7b1e8b1a828b1e]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02b3b810c2c31281b]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ec59b5cf9a456c05]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ff7971dd756acc47]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e0fda929294f3eaf]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-084580a23fa51a510]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-009effa389e10e6e8]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0b1241ae7a765744f]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07d4cff5782dfbb9f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02b3b810c2c31281b1080289494]
module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-0a6bb89717af7db4f]
module.alb.aws_vpc_security_group_ingress_rule.this["http"]: Refreshing state... [id=sgr-0fba6ee1e40b3639b]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-009314f0ef673299b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0140886bb1c7d8014]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:341795649416:loadbalancer/app/app1-alb/b4c06662bb38c741]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0730af722c3ce69e9]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e0d4e2c452112953]
aws_instance.app_server: Refreshing state... [id=i-063ba409344fee5e4]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01843169203e19bb7]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ff7971dd756acc471080289494]
module.lambda_trigger_cpu.aws_lambda_function.this[0]: Refreshing state... [id=trigger_cpu_load]
module.lambda_trigger_mem.aws_lambda_function.this[0]: Refreshing state... [id=trigger_mem_load]
aws_lambda_permission.allow_eventbridge_to_invoke_cpu: Refreshing state... [id=AllowExecutionFromEventBridgeCPU]
aws_lambda_permission.allow_eventbridge_to_invoke_mem: Refreshing state... [id=AllowExecutionFromEventBridgeMEM]
module.eventbridge_lambda_triggers.aws_cloudwatch_event_target.this["cpu-load-target"]: Refreshing state... [id=trigger-cpu-rule-terraform-20250411165117942900000001]
module.eventbridge_lambda_triggers.aws_cloudwatch_event_target.this["mem-load-target"]: Refreshing state... [id=trigger-mem-rule-terraform-20250411165117942900000002]
module.alb.aws_lb_target_group.this["app"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:341795649416:targetgroup/app120250408145226620400000008/8c5408e45d612854]
module.alb.aws_lb_target_group_attachment.this["app"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:341795649416:targetgroup/app120250408145226620400000008/8c5408e45d612854-20250408145228255300000009]
module.alb.aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:341795649416:listener/app/app1-alb/b4c06662bb38c741/500bd3564ed86136]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.lambda_trigger_cpu.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds\\efb60b39b773627b6d7adb2c96db325c0c35dac8fb4114f5924ee5f1621fd10c.zip" -> "builds/7d0e273d31cea8bdae09feadd6f94905819576aaf7d0b35288744e64c6191f8a.zip"
        id                             = "trigger_cpu_load"
      ~ last_modified                  = "2025-04-11T17:10:11.000+0000" -> (known after apply)
        tags                           = {
            "Name"                  = "trigger_cpu_load"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda_trigger_cpu.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "./lambda/trigger_cpu",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/7d0e273d31cea8bdae09feadd6f94905819576aaf7d0b35288744e64c6191f8a.zip"
              + runtime       = "nodejs20.x"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/7d0e273d31cea8bdae09feadd6f94905819576aaf7d0b35288744e64c6191f8a.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_trigger_cpu.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5441092466436930499" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds\\efb60b39b773627b6d7adb2c96db325c0c35dac8fb4114f5924ee5f1621fd10c.zip" -> "builds/7d0e273d31cea8bdae09feadd6f94905819576aaf7d0b35288744e64c6191f8a.zip"
          ~ "timestamp" = "1744390233358274000" -> "1744392525784651000"
        }
    }

  # module.lambda_trigger_mem.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds\\d8d8f2950fe452e7f84bec45ae488167688b31785a3f99beec5cbeebf9066d65.zip" -> "builds/a3901a215e1ed037f47d430b84512df0c597ecdfd2f0256316b13b062ffc6640.zip"
        id                             = "trigger_mem_load"
      ~ last_modified                  = "2025-04-11T17:10:18.000+0000" -> (known after apply)
        tags                           = {
            "Name"                  = "trigger_mem_load"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda_trigger_mem.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "./lambda/trigger_mem",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a3901a215e1ed037f47d430b84512df0c597ecdfd2f0256316b13b062ffc6640.zip"
              + runtime       = "nodejs20.x"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a3901a215e1ed037f47d430b84512df0c597ecdfd2f0256316b13b062ffc6640.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_trigger_mem.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8583920096647612317" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds\\d8d8f2950fe452e7f84bec45ae488167688b31785a3f99beec5cbeebf9066d65.zip" -> "builds/a3901a215e1ed037f47d430b84512df0c597ecdfd2f0256316b13b062ffc6640.zip"
          ~ "timestamp" = "1744390233290924000" -> "1744392525784667000"
        }
    }

Plan: 4 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```